import datetime
import json
import os

fin = "Шмотки в ранец и домой"
aft = "Не пожрал = посасал, пиздуй на пары (домой)"
fin_time_dist = 2
couples_dict_buffer = None
couples_json = r'[{"Pair":"1","Day":"Понедельник"},{"Info":"(53) (практ) Модели и методы анализа проектных решений , Исенбаева Е.Н.  3-609а","Pair":"1","Day":"Понедельник"},{"Info":"(53) (лекц) Сети и телекоммуникации, Коробейников А.А. 3-2","Pair":"2","Day":"Понедельник"},{"Info":"(53) (лекц) Сети и телекоммуникации, Коробейников А.А. 3-2","Pair":"2","Day":"Понедельник"},{"Info":"(53) (л/р) Модели и методы анализа проектных решений , Исупов Н.С.,  3-602","Pair":"3","Day":"Понедельник"},{"Pair":"3","Day":"Понедельник"},{"Info":"(53) (л/р) Модели и методы анализа проектных решений , Исупов Н.С.,  3-602","Pair":"4","Day":"Понедельник"},{"Pair":"4","Day":"Понедельник"},{"Pair":"5","Day":"Понедельник"},{"Pair":"5","Day":"Понедельник"},{"Pair":"6","Day":"Понедельник"},{"Pair":"6","Day":"Понедельник"},{"Pair":"7","Day":"Понедельник"},{"Pair":"7","Day":"Понедельник"},{"Info":"(53) (л/р) Сети и телекоммуникации, Коробейников А.А.,3-602","Pair":"1","Day":"Вторник"},{"Info":"(53) (л/р) Компьютерная графика, \r\nСоловьева А.Н.,  3-803","Pair":"1","Day":"Вторник"},{"Info":"(53) (л/р) Сети и телекоммуникации, Коробейников А.А.,3-602","Pair":"2","Day":"Вторник"},{"Info":"(53) (л/р) Компьютерная графика, Соловьева А.Н.,  3-803","Pair":"2","Day":"Вторник"},{"Info":"(53) (лекц) Геоинформационные системы, Шибанова Ю. В.  3-2","Pair":"3","Day":"Вторник"},{"Info":"(53) (лекц) Геоинформационные системы, Шибанова Ю. В.  3-2","Pair":"3","Day":"Вторник"},{"Info":"Физическая культура и спорт  (лекции проводятся в дистанционном формате по ссылке: https://clck.ru/aotP3 )   (1-1)         ","Pair":"4","Day":"Вторник"},{"Info":"Физическая культура и спорт  (лекции проводятся в дистанционном формате по ссылке: https://clck.ru/aotP3 )   (1-1)         ","Pair":"4","Day":"Вторник"},{"Pair":"5","Day":"Вторник"},{"Pair":"5","Day":"Вторник"},{"Pair":"6","Day":"Вторник"},{"Pair":"6","Day":"Вторник"},{"Pair":"7","Day":"Вторник"},{"Pair":"7","Day":"Вторник"},{"Info":"(53) (практ) Компьютерная графика, Соловьева А.Н.,  3-609а","Pair":"1","Day":"Среда"},{"Info":"(13) (л/р) Межкультурная профессиональная коммуникация, Булдакова Р.П. \r\n7-411","Pair":"1","Day":"Среда"},{"Info":"(53) (л/р) Геоинформационные системы, Шибанова Ю. В.,\r\n 3-803 ","Pair":"2","Day":"Среда"},{"Info":"(13) (л/р) Межкультурная профессиональная коммуникация, Булдакова Р.П. \r\n7-411","Pair":"2","Day":"Среда"},{"Info":"(53) (л/р) Геоинформационные системы, Шибанова Ю. В.,\r\n 3-803 ","Pair":"3","Day":"Среда"},{"Info":"(13) (л/р) Межкультурная профессиональная коммуникация, Булдакова Р.П. \r\n7-411","Pair":"3","Day":"Среда"},{"Pair":"4","Day":"Среда"},{"Info":"(13) (л/р) Межкультурная профессиональная коммуникация, Булдакова Р.П. \r\n7-411","Pair":"4","Day":"Среда"},{"Pair":"5","Day":"Среда"},{"Pair":"5","Day":"Среда"},{"Pair":"6","Day":"Среда"},{"Pair":"6","Day":"Среда"},{"Pair":"7","Day":"Среда"},{"Pair":"7","Day":"Среда"},{"Pair":"1","Day":"Четверг"},{"Pair":"1","Day":"Четверг"},{"Pair":"2","Day":"Четверг"},{"Info":"(53) (практ) Сети и телекоммуникации, Коробейников А.А. 3-609а","Pair":"2","Day":"Четверг"},{"Info":"Физическая культура и спорт (э.д.)","Pair":"3","Day":"Четверг"},{"Info":"Физическая культура и спорт (э.д.)","Pair":"3","Day":"Четверг"},{"Info":"(53) (лекц) Модели и методы анализа проектных решений , Исенбаева Е.Н.  3-2","Pair":"4","Day":"Четверг"},{"Info":"(53) (лекц) Модели и методы анализа проектных решений , Исенбаева Е.Н.  3-2","Pair":"4","Day":"Четверг"},{"Pair":"5","Day":"Четверг"},{"Pair":"5","Day":"Четверг"},{"Pair":"6","Day":"Четверг"},{"Pair":"6","Day":"Четверг"},{"Pair":"7","Day":"Четверг"},{"Pair":"7","Day":"Четверг"},{"Pair":"1","Day":"Пятница"},{"Pair":"1","Day":"Пятница"},{"Pair":"2","Day":"Пятница"},{"Pair":"2","Day":"Пятница"},{"Pair":"3","Day":"Пятница"},{"Pair":"3","Day":"Пятница"},{"Info":"(53) (лекц) Информационные системы, Исупов Н.С.  3-2","Pair":"4","Day":"Пятница"},{"Info":"(53) (лекц) Компьютерная графика, Соловьева А.Н. ,3-216","Pair":"4","Day":"Пятница"},{"Pair":"5","Day":"Пятница"},{"Info":"(53) (л/р) Информационные системы, Исупов Н.С., 3-602","Pair":"5","Day":"Пятница"},{"Pair":"6","Day":"Пятница"},{"Info":"(53) (л/р) Информационные системы, Исупов Н.С., 3-602","Pair":"6","Day":"Пятница"},{"Pair":"7","Day":"Пятница"},{"Pair":"7","Day":"Пятница"}]'

def schedule():
    global couples_dict_buffer
    if couples_dict_buffer is None:
        couples_dict_buffer = json.loads(couples_json)
    return couples_dict_buffer

def time_between(curr_time, start, finish):
    return start <= curr_time < finish

def to_minutes(hours, minutes):
    return hours * 60 + minutes

def check_couple(curr_time, start, finish, num):
    if time_between(curr_time, start, finish):
        time_dist = finish - curr_time
        return str(num) + '-я пара ' + ('(пиздец)' if num == 1 else '') + ' до конца: {0}ch {1}m'.format(time_dist//60, time_dist%60) if time_dist > fin_time_dist else fin
    return False

def couple(how_week):
    izhevsk_utc_date = datetime.datetime.utcnow() + datetime.timedelta(hours=4)
    curr_day = ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье'] [izhevsk_utc_date.weekday()]
    curr_time = izhevsk_utc_date.hour * 60 + izhevsk_utc_date.minute

    times = [to_minutes(8, 30), to_minutes(10, 0), to_minutes(11, 40), to_minutes(12, 20), to_minutes(13, 50), to_minutes(15, 30), to_minutes(17, 10), to_minutes(18, 50)]

    try:
        for i in range(len(times) - 1):
            ibuf = i + 1 if i < 3 else i
            buf = check_couple(curr_time, times[i], times[i + 1], ibuf)
            if buf:
                shed = schedule()
                j = 0 if how_week else 1
                while j < len(shed):
                    if (shed[j].get('Pair') == str(ibuf)) and (shed[j].get('Day') == curr_day):
                        info = (shed[j].get('Info') if not (shed[j].get('Info') is None) else 'Пар по расписанию нету :)')
                        buf += ('\n' + info[4:] if info[0]=='(' else info)
                        if j + 2 < len(shed):
                            if (shed[j + 2].get('Pair') == str(ibuf + 1)) and not (shed[j + 2].get('Info') is None):
                                info = shed[j + 2].get('Info')
                                buf += ('\nСледущая пара: ' + info[4:] if info[0]=='(' else info)
                        return buf
                    j += 2
        return 'Какая бля пара, дура4ёк?)?)?)? Пар нет, универ адыхает, иди домой.'
    except BaseException as error:
        print(error)
        return 'Сломалася я:('
