def help_faq():
    return "Я умею:\n" \
           "- Определять какая неделя сегодня или завтра, по средствам команд 📋/неделя📋 и 📋/неделя завтра📋, соответственно\n" \
           "- Выдавать погоду для Вас на сегодня/завтра/неделю, по средствам команд ☁/погода☁, ☁/погода завтра☁ и ☁/погода на неделю☁, соответвенно\n" \
           "- Отсылать скриншот с расположением необходимого вам автобуса, по средствам команд 🚍/автобус <номер автобуса>🚍, например 🚍/автобус 29🚍\n" \
           "- Выдавать список курсов ee.istu.ru, в ответ на команду /курсы\n" \
           "- Выдавать список ссылок на zoom, в ответ на команду /ссылки\n" \
           "- Писать какие сегодня/завтра пары, по средствам команд /расписание и /расписание завтра\n" \
           "\n" \
           "- Чтобы настроить меня под свою беседу, администратор беседы может написать /настроить, тогда я проконсультирую его в личном сообщении\n" \
           "- Вы можете попросить меня напомнить вам о каком-либо мероприятии, для этого напишите сюда /добавить мероприятие [дд.мм.гггг] [чч:мм] \"[Название мероприятия]\" \n" \
           "И я напомню о нём в указанные дату и время"