def welcome_msg():
    return "Всех приветствую, я восстал из ада, чтобы служить\n" \
           "Я умею:\n" \
           "- Определять какая неделя сегодня или завтра, по средствам команд 📋/неделя📋 и 📋/неделя завтра📋, соответственно\n" \
           "- Выдавать погоду для Вас на сегодня/завтра/неделю, по средствам команд ☁/погода☁, ☁/погода завтра☁ и ☁/погода на неделю☁, соответвенно\n" \
           "- Отсылать скриншот с расположением необходимого вам автобуса, по средствам команд 🚍/автобус <номер автобуса>🚍, например 🚍/автобус 29🚍\n" \
           "Помимо этого, я буду отсылать в данную беседу информацию о том какая неделя и какая будет погода в 8:00 и 20:00 автоматически⚙"